tutorials/multiphase/interDyMFoam/ras/mixerVesselAMI/constant/kineticTheoryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kineticTheoryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kineticTheory   off;

equilibrium     on;

e               e [ 0 0 0 0 0 0 0 ] 0.9;

alphaMax        alphaMax [ 0 0 0 0 0 0 0 ] 0.6;

alphaMinFriction alphaMinFriction [ 0 0 0 0 0 0 0 ] 0.5;

Fr              Fr [ 1 -1 -2 0 0 0 0 ] 0.05;

eta             eta [ 0 0 0 0 0 0 0 ] 2;

p               p [ 0 0 0 0 0 0 0 ] 5;

phi             phi [ 0 0 0 0 0 0 0 ] 25;

viscosityModel  Syamlal;

conductivityModel HrenyaSinclair;

granularPressureModel Lun;

frictionalStressModel JohnsonJackson;

radialModel     SinclairJackson;

HrenyaSinclairCoeffs
{
    L               L [ 0 1 0 0 0 0 0 ] 0.0005;
}


// ************************************************************************* //
